# Pandas

In [111]:
import pandas as pd

## Index

* Create a Dataframe
* Access data
  * Subseting data
* Modify column
  * Handle NaN
* Combine datasets
* Descriptive Statistics

## Create a Dataframe

* Create a dataframe by providing the rows

In [112]:
df = pd.DataFrame({
    "Product": ['Product 1','Product 1','Product 3','Product 3','Product 4'],
    "Price": [100.0, 200.0, 300.0, 400.0, 'NaN']
})
df

     Product Price
0  Product 1   100
1  Product 1   200
2  Product 3   300
3  Product 3   400
4  Product 4   NaN

* Create a dataframe by providing the columns:

In [113]:
items_wa = [['Product 1', 100], ['Product 1', 200], ['Product 3', 300], ['Product 3', 400], ['Product 4', 'nan']]
df = pd.DataFrame(items_wa, columns=['Product', 'Price'], dtype=float)
df

     Product  Price
0  Product 1  100.0
1  Product 1  200.0
2  Product 3  300.0
3  Product 3  400.0
4  Product 4    NaN

* Also can be read from a file executing:
`df = pd.read_csv(filename, sep="\t", index_col=None, names=['col 1', 'col2'])`

## Access data

* Access a column or list of columns

In [114]:
df["Price"]

0    100.0
1    200.0
2    300.0
3    400.0
4      NaN
Name: Price, dtype: float64

In [115]:
selected_columns=["Product","Price","Price"]
df[selected_columns]

     Product  Price  Price
0  Product 1  100.0  100.0
1  Product 1  200.0  200.0
2  Product 3  300.0  300.0
3  Product 3  400.0  400.0
4  Product 4    NaN    NaN

* Access a list of columns by index

In [116]:
 df.iloc[:,[0,1,1]]

     Product  Price  Price
0  Product 1  100.0  100.0
1  Product 1  200.0  200.0
2  Product 3  300.0  300.0
3  Product 3  400.0  400.0
4  Product 4    NaN    NaN

* Access of rows

In [117]:
df[0:2]

     Product  Price
0  Product 1  100.0
1  Product 1  200.0

* Access a list of rows

In [118]:
selected_rows=[0,0,1]
df.loc[selected_rows]

     Product  Price
0  Product 1  100.0
0  Product 1  100.0
1  Product 1  200.0

## Subseting data

In [119]:
df[df["Price"]>150]

     Product  Price
1  Product 1  200.0
2  Product 3  300.0
3  Product 3  400.0

* Example: Products with name number above two

In [120]:
products_above_2=df["Product"].str.split(" ").apply(lambda x: int(x[1]))>2
df[products_above_2]

     Product  Price
2  Product 3  300.0
3  Product 3  400.0
4  Product 4    NaN

## Modify column

In [121]:
#Multiply the price by two
df["Price"].apply(lambda x: x*2)

0    200.0
1    400.0
2    600.0
3    800.0
4      NaN
Name: Price, dtype: float64

In [122]:
#Replace the word "Product" by "Item"
df["Product"].str.replace("Product","Item")

0    Item 1
1    Item 1
2    Item 3
3    Item 3
4    Item 4
Name: Product, dtype: object

### Handle NaN

* Remove NaN

In [123]:
df.dropna()

     Product  Price
0  Product 1  100.0
1  Product 1  200.0
2  Product 3  300.0
3  Product 3  400.0

* Replace Nan with a number (e.g. zero)

In [124]:
df.fillna(0)

     Product  Price
0  Product 1  100.0
1  Product 1  200.0
2  Product 3  300.0
3  Product 3  400.0
4  Product 4    0.0

## Combine datasets

* Append datasets

In [125]:
pd.concat([df, df])

     Product  Price
0  Product 1  100.0
1  Product 1  200.0
2  Product 3  300.0
3  Product 3  400.0
4  Product 4    NaN
0  Product 1  100.0
1  Product 1  200.0
2  Product 3  300.0
3  Product 3  400.0
4  Product 4    NaN

* Join datasets

In [126]:
id_items = [['1', 'Product 1'], ['2', 'Product 2'], ['5', 'Product 5']]
id_prize = [['1', 10], ['2', 20], ['3', 30]]
dfi = pd.DataFrame(id_items, columns=['ID', 'Product'])
dfp = pd.DataFrame(id_prize, columns=['ID', 'Price'])
print(dfi)
print(dfp)

  ID    Product
0  1  Product 1
1  2  Product 2
2  5  Product 5
  ID  Price
0  1     10
1  2     20
2  3     30

In [127]:
pd.merge(dfi, dfp, on='ID')
# Equivalent to: pd.merge(dfi, dfp, left_on='ID', right_on='ID', how="inner")

  ID    Product  Price
0  1  Product 1     10
1  2  Product 2     20

In [128]:
#Use outer for an outer join (or "left" or "right")
pd.merge(dfi, dfp, left_on='ID', right_on='ID', how="outer")

  ID    Product  Price
0  1  Product 1   10.0
1  2  Product 2   20.0
2  5  Product 5    NaN
3  3        NaN   30.0

## Statistics

Only for numeric columns (use `df.dtypes` to check types of columns)

* Describe

In [129]:
df.describe()

            Price
count    4.000000
mean   250.000000
std    129.099445
min    100.000000
25%    175.000000
50%    250.000000
75%    325.000000
max    400.000000

* Grouping

In [130]:
df_wa.groupby(['Product']).sum()

           Price
Product
Product 1  300.0
Product 3  700.0
Product 4    0.0

In [131]:
df_wa.groupby(['Product']).agg(['mean', 'count','sum'])

           Price
            mean count    sum
Product
Product 1  150.0     2  300.0
Product 3  350.0     2  700.0
Product 4    NaN     0    0.0

## More info

* [1](https://stackabuse.com/beginners-tutorial-on-the-pandas-python-library/)
* [2](https://www.datacamp.com/community/tutorials/pandas-tutorial-dataframe-python)
* [3](https://www.datacamp.com/community/tutorials/pandas-tutorial-dataframe-python)